import { FactoryTarget } from '@angular/compiler';
import { Component, OnInit } from '@angular/core';

class User {
    first_name: string = 'Dmytro';
    last_name: string = 'Hobatiuk';
    profession_1: string = 'Storyteller';
    profession_2: string = 'Project manager';
    description: string = 'Personal website of the storyteller';
    phone: string = '+38 (063) 931-80-04';
    email: string = 'dmytrohobatiuk@ukr.net';
    facebook_url: string = 'https://www.facebook.com/profile.php?id=100069989741012';
    instagram_url: string = 'https://www.instagram.com/tyt.ua/';
    linkdin_url: string = '#';
    facebook_icon_black: string = '../assets/facebook_black.png';
    instagram_icon_black: string = '../assets/instagram_black.png';
    linkdin_icon_black: string = '../assets/linkdin_black.png';
    facebook_icon_grey: string = '../assets/facebook_grey.png';
    instagram_icon_grey: string = '../assets/instagram_grey.png';
    linkdin_icon_grey: string = '../assets/linkdin_grey.png';
    call_me_icon: string = '../assets/call_me.jpg';
    email_icon: string = '../assets/email.png';
    nav_blog : string = '/blog';
    nav_work : string = '/work';
    nav_about_me : string = '/about_me';
    nav_contact : string = '/contact';
    nav_resume : string = '#';
    nav_hire_me : string = '#';
    avatar : string = '../assets/avatar.jpg';
    intro_photo : string = '../assets/intro.jpg';
    intro_subtitle : string = 'Hello i`m';
    work_description : string = 'It is important for me the text is simple, useful, and it cares for the client.';
}
export default User
 
export interface Article {
  id : number
  date : object
  image : string
  title : string
  category : string
  text : string
}

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.scss']
})

export class AppComponent {
  article : Article
  blog : Article
  user : any = User 
  title : string = 'portfolio' 
  
  articles : Article [] = [
    {id : 0,
      date : [],
      image : '../assets/works_1.JPG', 
      title : 'Clown, Lover, and Boyfriend', 
      category : 'Characterization of the archetypes', 
      text : 'Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”\n'
       + 'Бренд Блазень\nЦе архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.\n'                                
      + 'Бренд Коханець\nРеклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.\n'
      + 'Бренд Свій хлопець\nАрхетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.\n'
      + 'Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».'},
    {date : [],
      id : 1,
      image : '../assets/works_2.jpg', 
      title : 'Religion and culture', 
      category : 'Article', 
      text : 'Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”\n'
      + 'Бренд Блазень\nЦе архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.\n'                                
     + 'Бренд Коханець\nРеклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.\n'
     + 'Бренд Свій хлопець\nАрхетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.</p>'
     + 'Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».'},
    {date : [],
      id : 2,
      image : '../assets/works_3.jpg', 
      title : 'Trip to Pereyaslav', 
      category : 'Travel guide', 
      text : '<p>Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”</p>'
      + '<p>Бренд Блазень<br>Це архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.</p>'                                
     + '<p>Бренд Коханець<br>Реклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.</p>'
     + '<p>Бренд Свій хлопець<br>Архетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.</p>'
     + '<p>Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».</p>'},
    {id : 3,
      date : [],
      image : '../assets/works_4.jpg', 
      title : 'Tourist tent for rent', 
      category : 'Advertising text', 
      text : '<p>Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”</p>'
      + '<p>Бренд Блазень<br>Це архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.</p>'                                
     + '<p>Бренд Коханець<br>Реклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.</p>'
     + '<p>Бренд Свій хлопець<br>Архетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.</p>'
     + '<p>Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».</p>'},
    {id : 4,
      date : [],
      image : '../assets/works_5.jpg', 
      title : 'Clown, Lover, and Boyfriend', 
      category : 'Characterization of the archetypes', 
      text : '<p>Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”</p>'
      + '<p>Бренд Блазень<br>Це архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.</p>'                                
     + '<p>Бренд Коханець<br>Реклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.</p>'
     + '<p>Бренд Свій хлопець<br>Архетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.</p>'
     + '<p>Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».</p>'},
    {id : 5,
      date : [],
      image : '../assets/works_6.jpg', 
      title : 'English-Ukrainian dictionary', 
      category : 'Article', 
      text : '<p>Бренди Блазня, Коханця та Свого хлопця об*єднує прагнення до приналежності. Людям яким важливі ці бренди потрібно відчувати привабливість, популярність, мати хороші стосунки з оточенням. Потенційних покупців брендів Блазня, Коханця та Свого хлопця цікавлять такі питання: “Я красивий/а?”, “Як мені зустріти кохання?”, “Мене приймають друзі такою/ким як я є?”, “Що зробити, щоб отримувати від життя насолоду?”</p>'
      + '<p>Бренд Блазень<br>Це архетип який любить жарти й цим може порушувати основи людських переконань. Блазень це також клоун, стендап комік, жартівник. Він дозволяє сміятись над важкими суспільними темами. Такий бренд закликає послабити самоконтроль і веселитись. Цей архетип найбільше підходить для того, щоб впоратись з сірими буднями, бюрократією та аморфністю. До брендів з архетипом Блазня в Україні належить ПАТ “Студія Квартал-95”. Її співзасновник актор, комік, а зараз президент України Володимир Зеленський відповідав цьому архетипу коли був артистом. До архетипу Блазня теж належать бренди “Файна Юкрайна”, “Вар*яти-шоу”, “Хто зве́рху ?”. Їхній співзасновник та комік, актор, політик й волонтер Сергій Притула відповідав архетипу до переходу в політику. Гумористично-аналітичне шоу "#@)₴?$0 з Майклом Щуром" також з архетипом Блазня.</p>'                                
     + '<p>Бренд Коханець<br>Реклама бренду з архетипом Коханця часто буває еротична. Архетип Коханець охоплює всі види любові: батьківську, дружню, духовну та романтичне кохання. Найчастіше в Україні архетип Коханця можна побачити в рекламі спідньої білизни, косметики, ювелірних прикрас та солодощів. Будь-який бренд, що обіцяє красу та сексуальну привабливість — це бренд Коханця. В Україні такими є ювелірний завод “Золотий Вік”, він заявляє : “Тобі личить моє кохання”, “Почуття прикрашають”. Бренд шоколаду “Корона” у своїх рекламних роликах переконує: “Корона смак бажання”, “Корона смак справжніх почуттів”. Реклама шоколаду AMOUR Dolci компанії “КОНТІ” за 2010 рік показує еротичні сцени закоханої пари, на фоні звучить твердження: “AMOUR там де любов”. Буває і примітивне використання архетипу Коханця. До них належать рекламні написи: “СОСИ СОЧНА Я” на ятках швидкого харчування. Банери, на яких рекламують цемент, але зображенні оголені жінки з написом: “Зі мною стає твердіший” та інші.</p>'
     + '<p>Бренд Свій хлопець<br>Архетип Свого хлопця чітко простежується у народній музиці, профспілках, місцевих фестивалях і карнавалах. Фільмах, що зображають слабкості пересічних людей. Коли в людині активізується архетип Свого хлопця, вона одягає повсякденний одяг (навіть у тому випадку, якщо ця людина заможна), говорить на простонародній мові, уникає елітності за будь-яку ціну. У цих вчинках закладено цінність та важливість людини як особистості. Ідея цього архетипу у тому, що всі хороші речі належать всім людям, а не тільки аристократам або багатіям.</p>'
     + '<p>Представником бренду Свій хлопець є українська мережа ресторанів національної кухні “Пузата хата”, українська мережа закладів громадського харчування “Львівські Круасани”, український інтернет-магазин та маркетплейс “Rozetka.ua”. За книгою Пірсон К., Марк М. - «Герой і бунтар. Створення бренду за допомогою архетипів».</p>'}
  ]

  blogs : Article [] = [
    {id : 0,
      date : [24, 'february', 2023],
      image : '../assets/article_1.jpg',
      title : 'A year as long as a day. A day as long as eternity.',
      category : 'War in Ukraine',
      text : 'I remember the evening of February 23, 2022, and the entire day of February 24, 2022, almost every hour and down to the last detail. I remembered the looks of the two people the most.'
    },

    {id : 1,
      date : [15, 'february', 2023],
      image : '../assets/articles_2.jpg',
      title : 'My house is on the edge: why is Ukraine*s neutrality a mistake?',
      category : 'War in Ukraine',
      text : 'We mistakenly believe that everything will be fine if we do not interfere anywhere. As a result, everyone put forward claims: Romania, Hungary, Russia, and even Belarus.'
    },

    {id : 2,
      date : [27, 'july', 2022],
      image : '../assets/800Trutovskyi_U_kolodiazia.jpg.crdownload',
      title : 'Are you ready to put your life on the line for sex?',
      category : 'different',
      text : 'Imagine sex, but the kind that brings you pleasure. Everything goes according to your wishes. The sensations are fantastic, you are half way to orgasm. But suddenly a siren bursts into your moan!'
    },
  ]

  changeArticle(id) {
    this.article = this.articles[id]
  }

  changeBlogId(idBlog) {
    this.blog = this.blogs[idBlog]
    console.log(this.blog)
  }

  ngOnInit() {
    
  }
  
}

